# Linear Regression Model

In [2]:
from sklearn.linear_model import LinearRegression
import numpy as np

In [3]:
# training features (input)
x = np.array([1,2,3]).reshape(-1,1)

In [4]:
# training output
y = np.array([2,4,6]).reshape(-1,1)

the function is 2x multiplication.

In [5]:
# Model
model = LinearRegression()

In [6]:
# Train
model.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [7]:
# Prediction
model.predict([[12]])

array([[24.]])

---
## Example - Housing Price

In [33]:
import pandas as pd

data = pd.read_csv('eg2.txt')
data.columns = ['Sq foot','Rooms','Price']

In [67]:
data.head()

   Sq foot  Rooms   Price
0     1600      3  329900
1     2400      3  369000
2     1416      2  232000
3     3000      4  539900
4     1985      4  299900

### Spliting the data

In [64]:
x_train = data.iloc[:40,:2]
x_test = data.iloc[-6:,:2]
x_test

    Sq foot  Rooms
40     2238      3
41     2567      4
42     1200      3
43      852      3
44     1852      4
45     1203      3

In [66]:
y_train = data.iloc[:40,-1]
y_test = data.iloc[-6:,-1]
y_test

40    329900
41    314000
42    299000
43    179900
44    299900
45    239500
Name: Price, dtype: int64

### Let's Train our Model

In [139]:
Model = LinearRegression()
Model.fit(x_train, y_train)
error = round(y_test - Model.predict(x_test),2)

In [143]:
error.rename('Error', inplace=True)

40    -46364.82
41   -102450.81
42     70343.48
43       730.66
44    -14874.56
45     10416.87
Name: Error, dtype: float64

In [144]:
Prediction_table = pd.concat([x_test,y_test,error], axis=1)

In [146]:
Prediction_table

    Sq foot  Rooms   Price      Error
40     2238      3  329900  -46364.82
41     2567      4  314000 -102450.81
42     1200      3  299000   70343.48
43      852      3  179900     730.66
44     1852      4  299900  -14874.56
45     1203      3  239500   10416.87

# Conclusion
* Linear Regresion is one of many ML models.
* It may not be the perfect model for this dataset as there are non-linearity involved